app/controllers/authentication_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "admin@interapthq.com"], ["LIMIT", 1]]
---
  def create
    if (user = User.find_by(email: params[:email])).nil?